---
kind: type
id: T:Autodesk.Revit.UI.ButtonData
source: html/5583a34f-06a1-dbd2-001f-51f57e9800ed.htm
---
# Autodesk.Revit.UI.ButtonData

Base class used to contain information necessary to construct a button in the Ribbon.

## Syntax (C#)
```csharp
public class ButtonData : RibbonItemData
```